// HelloWorld.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
    std::cout << "Clone - 원격저장소 복사" << endl;
    std::cout << "add - 스테이지 영역에 파일 추가" << endl;
    std::cout << "commit - 세이브, 스테이지 영역의 파일들을 가지고 커밋(세이브)를 만들 수 있다." << endl;
    std::cout << "push - 원격 저장소에 커밋을 업로드 한다" << endl;
    std::cout << "작업하고 저장 후 다시 이전 상태로 만들려면" << endl;
    std::cout << "스테이지 올리기 전에 코드뭉치 버리기를 실행하면" << endl;
    std::cout << "작업하기 전 상태로 돌아온다!!" << endl;
}

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
